# DBeam_SetLShutDepth

```pascal
PROCEDURE DBeam_SetLShutDepth(depth : INTEGER);
```

```python
def vs.DBeam_SetLShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER|   |

## Examples
```pascal
DBeam_SetLShutDepth(1);
```
```python
import vs

depth = 1

vs.DBeam_SetLShutDepth(depth)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight